content/posts/visual_interfaces.md
+++
title = "Visual Interfaces"
author = ["Joe Corneli"]
lastmod = 2020-09-12T21:07:53+01:00
slug = "visual_interfaces"
draft = false
+++

## Graphical flow for programs {#graphical-flow-for-programs}

Can we model more general program flow in a similar fashion to Monocl?


## Limitations {#limitations}

The idea of graphical programming languages is linked with the
[Deutsch\_limit](https://en.wikipedia.org/wiki/Deutsch%5Flimit) (for noted programmer [L Peter Deutsch](https://en.wikipedia.org/wiki/L.%5FPeter%5FDeutsch), not [David Deutsch
FRS](https://en.wikipedia.org/wiki/David%5FDeutsch), though perhaps he could come into play later):

> _The problem with visual programming is that you can’t have more than 50 visual primitives on the screen at the same time._


## Automatically create visual interfaces {#automatically-create-visual-interfaces}

Here's an idea: assuming we have enough text mining pixie dust (on
corpora of linux man pages, and stack overflow questions/forum posts
about linux commands), it might be possible to do:

`user:~$ make-gui-for ls --output ls.py`


## Next steps {#next-steps}

-   [Probabilistic programming for scientific modelling]({{< relref "probabilistic_programming_for_scientific_modelling" >}})
-   [Paperspace DO NJ etc. Collaboratory]({{< relref "paperspace_do_nj_etc_collaboratory" >}})
-   [Advances in tutoring systems for programming]({{< relref "advances_in_tutoring_systems_for_programming" >}})


## Backlinks {#backlinks}

-   [Generating small graphs]({{< relref "generating_small_graphs" >}})
